<a href="https://colab.research.google.com/github/Prathibha-bm/take_it_smart/blob/main/class14.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [74]:
#pandas : it is a python lybrary used for data manupulation,data analysis  and cleaning, primary handling structured data through FataFrame and Series structures
import pandas as pd

data={
    'age':[23,34,45,56,67],
    'name':['sam','pam','ram','sham','seema'],
    'marks':[248,38,200,549,867],
    'city':['blg','chenni','mum','delhi','pune'],
    'contry':['india','india','None','Eourop','India'],
    'IDHnumber':[None,284,285,286,207]
}

#print(data) dataframe
df=pd.DataFrame(data)
print('\n\nData Frame\n\n',df)

#series
df=pd.Series(data)
print('\n\n1)Series\n\n',df)

x=df.head(2)
print('\n\n2)Head\n\n',x)

x=df.tail(2)
print('\n\n 3)Tail\n\n',x)

Data Frame

    age   name  marks    city  contry  IDHnumber
0   23    sam    248     blg   india        NaN
1   34    pam     38  chenni   india      284.0
2   45    ram    200     mum    None      285.0
3   56   sham    549   delhi  Eourop      286.0
4   67  seema    867    pune   India      207.0


1)Series

 age                         [23, 34, 45, 56, 67]
name                [sam, pam, ram, sham, seema]
marks                   [248, 38, 200, 549, 867]
city             [blg, chenni, mum, delhi, pune]
contry       [india, india, None, Eourop, India]
IDHnumber             [None, 284, 285, 286, 207]
dtype: object


2)Head

 age             [23, 34, 45, 56, 67]
name    [sam, pam, ram, sham, seema]
dtype: object


 3)Tail

 contry       [india, india, None, Eourop, India]
IDHnumber             [None, 284, 285, 286, 207]
dtype: object

In [76]:
import pandas as pd
df=pd.DataFrame(data)

print('\n\n1)Columns\n\n',df.columns)
print('\n\n2) Info\n\n',df.info())
print('\n\n3) Describe\n\n',df.describe)
print('\n\n4) iloc\n\n',df.iloc[0:4])

1)Columns

 Index(['age', 'name', 'marks', 'city', 'contry', 'IDHnumber'], dtype='object')
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   age        5 non-null      int64
 1   name       5 non-null      object
 2   marks      5 non-null      int64
 3   city       5 non-null      object
 4   contry     5 non-null      object
 5   IDHnumber  4 non-null      float64
dtypes: float64(1), int64(2), object(3)
memory usage: 372.0+ bytes


2) Info

 None


3) Describe

 <bound method NDFrame.describe of    age   name  marks    city  contry  IDHnumber
0   23    sam    248     blg   india        NaN
1   34    pam     38  chenni   india      284.0
2   45    ram    200     mum    None      285.0
3   56   sham    549   delhi  Eourop      286.0
4   67  seema    867    pune   India      207.0>


4) iloc

    age  name  marks    city  contry  IDHnumber
0   23   sam    248     blg   india        NaN
1   34   pam     38  chenni   india      284.0
2   45   ram    200     mum    None      285.0
3   56  sham    549   delhi  Eourop      286.0

In [79]:
#filter data
x=df[df['marks']>100]
print('\n1\n',x)

x=df[df['city']=='delhi']
print('\n2)\n',x)

x=df[(df['city']=='delhi')&(df['marks']>100)]
print('\n3)\n',x)

x=df['marks'].sum()
print('\n4) marks sum:\n',x)

x=df['marks'].count()
print('\n 5)marks count:\n',x)


#adding new column
x=df[' grade']=['b','d','c','a','a']
print('\n6) grade:\n',df)

x=df['Result']=df['marks']>75
print('\n7) Result:\n',df)

#dort_values
x=df.sort_values('marks',ascending=False)
print('\n8) sort_values:\n',x)


#groupby
x=df.groupby('city')['marks'].mean()
print("\n9) groupby\n",x)

#filling missing value

x=df.isnull().sum()
print('\n 10)\n',x)

x=df.fillna('unknown')
print("\n11)fillna \n",x)

x=df.dropna()
print("\n12)dropna\n",x)

1
    age   name  marks   city  contry  IDHnumber  grade  Result
0   23    sam    248    blg   india        NaN      b    True
2   45    ram    200    mum    None      285.0      c    True
3   56   sham    549  delhi  Eourop      286.0      a    True
4   67  seema    867   pune   India      207.0      a    True

2)
    age  name  marks   city  contry  IDHnumber  grade  Result
3   56  sham    549  delhi  Eourop      286.0      a    True

3)
    age  name  marks   city  contry  IDHnumber  grade  Result
3   56  sham    549  delhi  Eourop      286.0      a    True

4) marks sum:
 1902

 5)marks count:
 5

6) grade:
    age   name  marks    city  contry  IDHnumber  grade  Result
0   23    sam    248     blg   india        NaN      b    True
1   34    pam     38  chenni   india      284.0      d   False
2   45    ram    200     mum    None      285.0      c    True
3   56   sham    549   delhi  Eourop      286.0      a    True
4   67  seema    867    pune   India      207.0      a    True

7) Result:
    age   name  marks    city  contry  IDHnumber  grade  Result
0   23    sam    248     blg   india        NaN      b    True
1   34    pam     38  chenni   india      284.0      d   False
2   45    ram    200     mum    None      285.0      c    True
3   56   sham    549   delhi  Eourop      286.0      a    True
4   67  seema    867    pune   India      207.0      a    True

8) sort_values:
    age   name  marks    city  contry  IDHnumber  grade  Result
4   67  seema    867    pune   India      207.0      a    True
3   56   sham    549   delhi  Eourop      286.0      a    True
0   23    sam    248     blg   india        NaN      b    True
2   45    ram    200     mum    None      285.0      c    True
1   34    pam     38  chenni   india      284.0      d   False

9) groupby
 city
blg       248.0
chenni     38.0
delhi     549.0
mum       200.0
pune      867.0
Name: marks, dtype: float64

 10)
 age          0
name         0
marks        0
city         0
contry       0
IDHnumber    1
 grade       0
Result       0
dtype: int64

11)fillna
    age   name  marks    city  contry IDHnumber  grade  Result
0   23    sam    248     blg   india   unknown      b    True
1   34    pam     38  chenni   india     284.0      d   False
2   45    ram    200     mum    None     285.0      c    True
3   56   sham    549   delhi  Eourop     286.0      a    True
4   67  seema    867    pune   India     207.0      a    True

12)dropna
    age   name  marks    city  contry  IDHnumber  grade  Result
1   34    pam     38  chenni   india      284.0      d   False
2   45    ram    200     mum    None      285.0      c    True
3   56   sham    549   delhi  Eourop      286.0      a    True
4   67  seema    867    pune   India      207.0      a    True



# Task 3.4

#Create an employee dataset and perform all the above operations

In [56]:
import pandas as pd

employee={
    'name':['Ram','Sham','Tom','leela','seema'],
    'id':[1,2,3,4,5],
    'department':['Design','developer','testing','developer','marketing'],
    'salary':[45000,35000,40000,35000,50000],
    'experience':[5,7,9,3,4],
    'country':['India','India',None,'Eourop','India']

}


#print(data) dataframe
df=pd.DataFrame(employee)
print('\n1) DataFrame\n',df)

#series
df=pd.Series(employee)
print('\n2) \n',df)

x=df.head(2)
print('\n3) Head \n',x)

x=df.tail(2)
print('\n4) Tail\n',x)

1) DataFrame
     name  id department  salary  experience country
0    Ram   1     Design   45000           5   India
1   Sham   2  developer   35000           7   India
2    Tom   3    testing   40000           9    None
3  leela   4  developer   35000           3  Eourop
4  seema   5  marketing   50000           4   India

2)
 name                             [Ram, Sham, Tom, leela, seema]
id                                              [1, 2, 3, 4, 5]
department    [Design, developer, testing, developer, market...
salary                      [45000, 35000, 40000, 35000, 50000]
experience                                      [5, 7, 9, 3, 4]
country                     [India, India, None, Eourop, India]
dtype: object

3) Head
 name    [Ram, Sham, Tom, leela, seema]
id                     [1, 2, 3, 4, 5]
dtype: object

4) Tail
 experience                        [5, 7, 9, 3, 4]
country       [India, India, None, Eourop, India]
dtype: object

In [80]:
import pandas as pd
df=pd.DataFrame(employee)

print('\n\n 1)Columns\n\n',df.columns)
print('\n\n2)Info\n\n',df.info())
print('\n\n3)Describe\n\n',df.describe)
print('\n\n4)iloc\n\n',df.iloc[0:4])

 1)Columns

 Index(['name', 'id', 'department', 'salary', 'experience', 'country'], dtype='object')
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        5 non-null      object
 1   id          5 non-null      int64
 2   department  5 non-null      object
 3   salary      5 non-null      int64
 4   experience  5 non-null      int64
 5   country     4 non-null      object
dtypes: int64(3), object(3)
memory usage: 372.0+ bytes


2)Info

 None


3)Describe

 <bound method NDFrame.describe of     name  id department  salary  experience country
0    Ram   1     Design   45000           5   India
1   Sham   2  developer   35000           7   India
2    Tom   3    testing   40000           9    None
3  leela   4  developer   35000           3  Eourop
4  seema   5  marketing   50000           4   India>


4)iloc

     name  id department  salary  experience country
0    Ram   1     Design   45000           5   India
1   Sham   2  developer   35000           7   India
2    Tom   3    testing   40000           9    None
3  leela   4  developer   35000           3  Eourop

In [81]:
import pandas as pd
df=pd.DataFrame(employee)

#filter data
x=df[df['experience']>5]
print('\n\n1)minimum 5 years of experience\n\n',x)

x=df[df['country']=='India']
print('\n\n2)Indians\n\n',x)

x=df[(df['country']=='India')&(df['experience']>5)]
print('\n\n3)greater than 5 years of experienced Indians\n \n',x)

x=df['salary'].sum()
print('\n\n4) salary sum:',x)

x=df['name'].count()
print('\n5) Number of employees: ',x)

#adding new column
df['age']=[24,54,27,34,25]
print('\n\n6) adding new column(age_column added)\n\n',df)

df['new']=df['age']>25
print('\n\n6i) new:\n\n',df)

#sort_values(ascending)
x=df.sort_values('experience',ascending=True)
print('\n\n7) sort_experience(ascending):\n\n',x)

#sort_values(descending)
x=df.sort_values('experience',ascending=False)
print('\n\n8) sort_experience(decending):\n\n',x)

#groupby
x=df.groupby('country')['age'].mean()
print("\n\n9) groupby country and age\n\n",x)


#filling missing value
x=df.isnull().sum()
print('\n\n 10)\n\n',x)

x=df.fillna('unknown')
print("\n\n11)filled with unknown\n\n",x)


x=df.dropna()
print("\n\n 12)Droped\n\n ",x)

print('\n\n13\n\n',df)

1)minimum 5 years of experience

    name  id department  salary  experience country
1  Sham   2  developer   35000           7   India
2   Tom   3    testing   40000           9    None


2)Indians

     name  id department  salary  experience country
0    Ram   1     Design   45000           5   India
1   Sham   2  developer   35000           7   India
4  seema   5  marketing   50000           4   India


3)greater than 5 years of experienced Indians

    name  id department  salary  experience country
1  Sham   2  developer   35000           7   India


4) salary sum: 205000

5) Number of employees:  5


6) adding new column(age_column added)

     name  id department  salary  experience country  age
0    Ram   1     Design   45000           5   India   24
1   Sham   2  developer   35000           7   India   54
2    Tom   3    testing   40000           9    None   27
3  leela   4  developer   35000           3  Eourop   34
4  seema   5  marketing   50000           4   India   25


6i) new:

     name  id department  salary  experience country  age    new
0    Ram   1     Design   45000           5   India   24  False
1   Sham   2  developer   35000           7   India   54   True
2    Tom   3    testing   40000           9    None   27   True
3  leela   4  developer   35000           3  Eourop   34   True
4  seema   5  marketing   50000           4   India   25  False


7) sort_experience(ascending):

     name  id department  salary  experience country  age    new
3  leela   4  developer   35000           3  Eourop   34   True
4  seema   5  marketing   50000           4   India   25  False
0    Ram   1     Design   45000           5   India   24  False
1   Sham   2  developer   35000           7   India   54   True
2    Tom   3    testing   40000           9    None   27   True


8) sort_experience(decending):

     name  id department  salary  experience country  age    new
2    Tom   3    testing   40000           9    None   27   True
1   Sham   2  developer   35000           7   India   54   True
0    Ram   1     Design   45000           5   India   24  False
4  seema   5  marketing   50000           4   India   25  False
3  leela   4  developer   35000           3  Eourop   34   True


9) groupby country and age

 country
Eourop    34.000000
India     34.333333
Name: age, dtype: float64


 10)

 name          0
id            0
department    0
salary        0
experience    0
country       1
age           0
new           0
dtype: int64


11)filled with unknown

     name  id department  salary  experience  country  age    new
0    Ram   1     Design   45000           5    India   24  False
1   Sham   2  developer   35000           7    India   54   True
2    Tom   3    testing   40000           9  unknown   27   True
3  leela   4  developer   35000           3   Eourop   34   True
4  seema   5  marketing   50000           4    India   25  False


 12)Droped

      name  id department  salary  experience country  age    new
0    Ram   1     Design   45000           5   India   24  False
1   Sham   2  developer   35000           7   India   54   True
3  leela   4  developer   35000           3  Eourop   34   True
4  seema   5  marketing   50000           4   India   25  False


13

     name  id department  salary  experience country  age    new
0    Ram   1     Design   45000           5   India   24  False
1   Sham   2  developer   35000           7   India   54   True
2    Tom   3    testing   40000           9    None   27   True
3  leela   4  developer   35000           3  Eourop   34   True
4  seema   5  marketing   50000           4   India   25  False